apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_system.h
/****************************************************************************
 * arch/xtensa/src/esp32s2/hardware/esp32s2_system.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_SYSTEM_H
#define __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_SYSTEM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s2_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* SYSTEM_ROM_CTRL_0_REG register
 * System ROM configuration register 0
 */

#define SYSTEM_ROM_CTRL_0_REG (DR_REG_SYSTEM_BASE + 0x0)

/* SYSTEM_ROM_FO : R/W; bitpos: [1:0]; default: 3;
 * This field is used to force on clock gate of internal ROM.
 */

#define SYSTEM_ROM_FO    0x00000003
#define SYSTEM_ROM_FO_M  (SYSTEM_ROM_FO_V << SYSTEM_ROM_FO_S)
#define SYSTEM_ROM_FO_V  0x00000003
#define SYSTEM_ROM_FO_S  0

/* SYSTEM_ROM_CTRL_1_REG register
 * System ROM configuration register 1
 */

#define SYSTEM_ROM_CTRL_1_REG (DR_REG_SYSTEM_BASE + 0x4)

/* SYSTEM_ROM_FORCE_PU : R/W; bitpos: [3:2]; default: 3;
 * This field is used to power up internal ROM.
 */

#define SYSTEM_ROM_FORCE_PU    0x00000003
#define SYSTEM_ROM_FORCE_PU_M  (SYSTEM_ROM_FORCE_PU_V << SYSTEM_ROM_FORCE_PU_S)
#define SYSTEM_ROM_FORCE_PU_V  0x00000003
#define SYSTEM_ROM_FORCE_PU_S  2

/* SYSTEM_ROM_FORCE_PD : R/W; bitpos: [1:0]; default: 0;
 * This field is used to power down internal ROM.
 */

#define SYSTEM_ROM_FORCE_PD    0x00000003
#define SYSTEM_ROM_FORCE_PD_M  (SYSTEM_ROM_FORCE_PD_V << SYSTEM_ROM_FORCE_PD_S)
#define SYSTEM_ROM_FORCE_PD_V  0x00000003
#define SYSTEM_ROM_FORCE_PD_S  0

/* SYSTEM_SRAM_CTRL_0_REG register
 * System SRAM configuration register 0
 */

#define SYSTEM_SRAM_CTRL_0_REG (DR_REG_SYSTEM_BASE + 0x8)

/* SYSTEM_SRAM_FO : R/W; bitpos: [21:0]; default: 4194303;
 * This field is used to force on clock gate of internal SRAM.
 */

#define SYSTEM_SRAM_FO    0x003fffff
#define SYSTEM_SRAM_FO_M  (SYSTEM_SRAM_FO_V << SYSTEM_SRAM_FO_S)
#define SYSTEM_SRAM_FO_V  0x003fffff
#define SYSTEM_SRAM_FO_S  0

/* SYSTEM_SRAM_CTRL_1_REG register
 * System SRAM configuration register 1
 */

#define SYSTEM_SRAM_CTRL_1_REG (DR_REG_SYSTEM_BASE + 0xc)

/* SYSTEM_SRAM_FORCE_PD : R/W; bitpos: [21:0]; default: 0;
 * This field is used to power down internal SRAM.
 */

#define SYSTEM_SRAM_FORCE_PD    0x003fffff
#define SYSTEM_SRAM_FORCE_PD_M  (SYSTEM_SRAM_FORCE_PD_V << SYSTEM_SRAM_FORCE_PD_S)
#define SYSTEM_SRAM_FORCE_PD_V  0x003fffff
#define SYSTEM_SRAM_FORCE_PD_S  0

/* SYSTEM_CPU_PERI_CLK_EN_REG register
 * CPU peripheral clock enable register
 */

#define SYSTEM_CPU_PERI_CLK_EN_REG (DR_REG_SYSTEM_BASE + 0x10)

/* SYSTEM_CLK_EN_DEDICATED_GPIO : R/W; bitpos: [7]; default: 0;
 * Set this bit to enable clock of DEDICATED GPIO module.
 */

#define SYSTEM_CLK_EN_DEDICATED_GPIO    (BIT(7))
#define SYSTEM_CLK_EN_DEDICATED_GPIO_M  (SYSTEM_CLK_EN_DEDICATED_GPIO_V << SYSTEM_CLK_EN_DEDICATED_GPIO_S)
#define SYSTEM_CLK_EN_DEDICATED_GPIO_V  0x00000001
#define SYSTEM_CLK_EN_DEDICATED_GPIO_S  7

/* SYSTEM_CLK_EN_ASSIST_DEBUG : R/W ;bitpos:[6] ;default: 0 */

#define SYSTEM_CLK_EN_ASSIST_DEBUG  (BIT(6))
#define SYSTEM_CLK_EN_ASSIST_DEBUG_M  (BIT(6))
#define SYSTEM_CLK_EN_ASSIST_DEBUG_V  0x1
#define SYSTEM_CLK_EN_ASSIST_DEBUG_S  6

/* SYSTEM_CPU_PERI_RST_EN_REG register
 * CPU peripheral reset register
 */

#define SYSTEM_CPU_PERI_RST_EN_REG (DR_REG_SYSTEM_BASE + 0x14)

/* SYSTEM_RST_EN_DEDICATED_GPIO : R/W; bitpos: [7]; default: 1;
 * Set this bit to reset DEDICATED GPIO module.
 */

#define SYSTEM_RST_EN_DEDICATED_GPIO    (BIT(7))
#define SYSTEM_RST_EN_DEDICATED_GPIO_M  (SYSTEM_RST_EN_DEDICATED_GPIO_V << SYSTEM_RST_EN_DEDICATED_GPIO_S)
#define SYSTEM_RST_EN_DEDICATED_GPIO_V  0x00000001
#define SYSTEM_RST_EN_DEDICATED_GPIO_S  7

/* SYSTEM_RST_EN_ASSIST_DEBUG : R/W ;bitpos:[6] ;default: 1 ; */

#define SYSTEM_RST_EN_ASSIST_DEBUG  (BIT(6))
#define SYSTEM_RST_EN_ASSIST_DEBUG_M  (BIT(6))
#define SYSTEM_RST_EN_ASSIST_DEBUG_V  0x1
#define SYSTEM_RST_EN_ASSIST_DEBUG_S  6

/* SYSTEM_CPU_PER_CONF_REG register
 * CPU peripheral clock configuration register
 */

#define SYSTEM_CPU_PER_CONF_REG (DR_REG_SYSTEM_BASE + 0x18)

/* SYSTEM_CPU_WAITI_DELAY_NUM : R/W; bitpos: [7:4]; default: 0;
 * Sets the number of delay cycles to enter CPU wait mode after a WAITI
 * instruction.
 */

#define SYSTEM_CPU_WAITI_DELAY_NUM    0x0000000f
#define SYSTEM_CPU_WAITI_DELAY_NUM_M  (SYSTEM_CPU_WAITI_DELAY_NUM_V << SYSTEM_CPU_WAITI_DELAY_NUM_S)
#define SYSTEM_CPU_WAITI_DELAY_NUM_V  0x0000000f
#define SYSTEM_CPU_WAITI_DELAY_NUM_S  4

/* SYSTEM_CPU_WAIT_MODE_FORCE_ON : R/W; bitpos: [3]; default: 1;
 * Set this bit to force on CPU wait mode. In this mode, the clock gate of
 * CPU is turned off until any interrupts happen. This mode could also be
 * force on via WAITI instruction.
 */

#define SYSTEM_CPU_WAIT_MODE_FORCE_ON    (BIT(3))
#define SYSTEM_CPU_WAIT_MODE_FORCE_ON_M  (SYSTEM_CPU_WAIT_MODE_FORCE_ON_V << SYSTEM_CPU_WAIT_MODE_FORCE_ON_S)
#define SYSTEM_CPU_WAIT_MODE_FORCE_ON_V  0x00000001
#define SYSTEM_CPU_WAIT_MODE_FORCE_ON_S  3

/* SYSTEM_PLL_FREQ_SEL : R/W; bitpos: [2]; default: 1;
 * This field is used to select the PLL clock frequency based on CPU period.
 */

