apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_system.h
#define SYSTEM_PLL_FREQ_SEL    (BIT(2))
#define SYSTEM_PLL_FREQ_SEL_M  (SYSTEM_PLL_FREQ_SEL_V << SYSTEM_PLL_FREQ_SEL_S)
#define SYSTEM_PLL_FREQ_SEL_V  0x00000001
#define SYSTEM_PLL_FREQ_SEL_S  2

/* SYSTEM_CPUPERIOD_SEL : R/W; bitpos: [1:0]; default: 0;
 * This field is used to select the clock frequency of CPU or CPU period.
 */

#define SYSTEM_CPUPERIOD_SEL    0x00000003
#define SYSTEM_CPUPERIOD_SEL_M  (SYSTEM_CPUPERIOD_SEL_V << SYSTEM_CPUPERIOD_SEL_S)
#define SYSTEM_CPUPERIOD_SEL_V  0x00000003
#define SYSTEM_CPUPERIOD_SEL_S  0

/* SYSTEM_JTAG_CTRL_0_REG register
 * JTAG configuration register 0
 */

#define SYSTEM_JTAG_CTRL_0_REG (DR_REG_SYSTEM_BASE + 0x1c)

/* SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_0 : WOR; bitpos: [31:0];
 * default: 0;
 * Stores the 0 to 31 bits of the 256 bits register used to cancel the
 * temporary disable of eFuse to JTAG.
 */

#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_0    0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_0_M  (SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_0_V << SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_0_S)
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_0_V  0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_0_S  0

/* SYSTEM_JTAG_CTRL_1_REG register
 * JTAG configuration register 1
 */

#define SYSTEM_JTAG_CTRL_1_REG (DR_REG_SYSTEM_BASE + 0x20)

/* SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_1 : WOR; bitpos: [31:0];
 * default: 0;
 * Stores the 32 to 63 bits of the 256 bits register used to cancel the
 * temporary disable of eFuse to JTAG.
 */

#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_1    0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_1_M  (SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_1_V << SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_1_S)
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_1_V  0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_1_S  0

/* SYSTEM_JTAG_CTRL_2_REG register
 * JTAG configuration register 2
 */

#define SYSTEM_JTAG_CTRL_2_REG (DR_REG_SYSTEM_BASE + 0x24)

/* SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_2 : WOR; bitpos: [31:0];
 * default: 0;
 * Stores the 64 to 95 bits of the 256 bits register used to cancel the
 * temporary disable of eFuse to JTAG.
 */

#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_2    0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_2_M  (SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_2_V << SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_2_S)
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_2_V  0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_2_S  0

/* SYSTEM_JTAG_CTRL_3_REG register
 * JTAG configuration register 3
 */

#define SYSTEM_JTAG_CTRL_3_REG (DR_REG_SYSTEM_BASE + 0x28)

/* SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_3 : WOR; bitpos: [31:0];
 * default: 0;
 * Stores the 96 to 127 bits of the 256 bits register used to cancel the
 * temporary disable of eFuse to JTAG.
 */

#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_3    0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_3_M  (SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_3_V << SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_3_S)
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_3_V  0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_3_S  0

/* SYSTEM_JTAG_CTRL_4_REG register
 * JTAG configuration register 4
 */

#define SYSTEM_JTAG_CTRL_4_REG (DR_REG_SYSTEM_BASE + 0x2c)

/* SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_4 : WOR; bitpos: [31:0];
 * default: 0;
 * Stores the 128 to 159 bits of the 256 bits register used to cancel the
 * temporary disable of eFuse to JTAG.
 */

#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_4    0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_4_M  (SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_4_V << SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_4_S)
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_4_V  0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_4_S  0

/* SYSTEM_JTAG_CTRL_5_REG register
 * JTAG configuration register 5
 */

#define SYSTEM_JTAG_CTRL_5_REG (DR_REG_SYSTEM_BASE + 0x30)

/* SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_5 : WOR; bitpos: [31:0];
 * default: 0;
 * Stores the 160 to 191 bits of the 256 bits register used to cancel the
 * temporary disable of eFuse to JTAG.
 */

#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_5    0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_5_M  (SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_5_V << SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_5_S)
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_5_V  0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_5_S  0

/* SYSTEM_JTAG_CTRL_6_REG register
 * JTAG configuration register 6
 */

#define SYSTEM_JTAG_CTRL_6_REG (DR_REG_SYSTEM_BASE + 0x34)

/* SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_6 : WOR; bitpos: [31:0];
 * default: 0;
 * Stores the 192 to 223 bits of the 256 bits register used to cancel the
 * temporary disable of eFuse to JTAG.
 */

#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_6    0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_6_M  (SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_6_V << SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_6_S)
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_6_V  0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_6_S  0

/* SYSTEM_JTAG_CTRL_7_REG register
 * JTAG configuration register 7
 */

#define SYSTEM_JTAG_CTRL_7_REG (DR_REG_SYSTEM_BASE + 0x38)

/* SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_7 : WOR; bitpos: [31:0];
 * default: 0;
 * Stores the 0 to 224 bits of the 255 bits register used to cancel the
 * temporary disable of eFuse to JTAG.
 */

#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_7    0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_7_M  (SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_7_V << SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_7_S)
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_7_V  0xffffffff
#define SYSTEM_CANCEL_EFUSE_DISABLE_JTAG_TEMPORARY_7_S  0

/* SYSTEM_MEM_PD_MASK_REG register
 * Memory power-related controlling register (under low-sleep)
 */

#define SYSTEM_MEM_PD_MASK_REG (DR_REG_SYSTEM_BASE + 0x3c)

