apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_system.h
/* SYSTEM_PERIP_RST_EN0_REG register
 * System peripheral (hardware accelerators) reset register 0
 */

#define SYSTEM_PERIP_RST_EN0_REG (DR_REG_SYSTEM_BASE + 0x48)

/* SYSTEM_SPI4_RST : R/W; bitpos: [31]; default: 0;
 * Set this bit to reset SPI4.
 */

#define SYSTEM_SPI4_RST    (BIT(31))
#define SYSTEM_SPI4_RST_M  (SYSTEM_SPI4_RST_V << SYSTEM_SPI4_RST_S)
#define SYSTEM_SPI4_RST_V  0x00000001
#define SYSTEM_SPI4_RST_S  31

/* SYSTEM_ADC2_ARB_RST : R/W; bitpos: [30]; default: 0;
 * Set this bit to reset aribiter of ADC2.
 */

#define SYSTEM_ADC2_ARB_RST    (BIT(30))
#define SYSTEM_ADC2_ARB_RST_M  (SYSTEM_ADC2_ARB_RST_V << SYSTEM_ADC2_ARB_RST_S)
#define SYSTEM_ADC2_ARB_RST_V  0x00000001
#define SYSTEM_ADC2_ARB_RST_S  30

/* SYSTEM_SYSTIMER_RST : R/W; bitpos: [29]; default: 0;
 * Set this bit to reset system timer.
 */

#define SYSTEM_SYSTIMER_RST    (BIT(29))
#define SYSTEM_SYSTIMER_RST_M  (SYSTEM_SYSTIMER_RST_V << SYSTEM_SYSTIMER_RST_S)
#define SYSTEM_SYSTIMER_RST_V  0x00000001
#define SYSTEM_SYSTIMER_RST_S  29

/* SYSTEM_APB_SARADC_RST : R/W; bitpos: [28]; default: 0;
 * Set this bit to reset SAR ADC.
 */

#define SYSTEM_APB_SARADC_RST    (BIT(28))
#define SYSTEM_APB_SARADC_RST_M  (SYSTEM_APB_SARADC_RST_V << SYSTEM_APB_SARADC_RST_S)
#define SYSTEM_APB_SARADC_RST_V  0x00000001
#define SYSTEM_APB_SARADC_RST_S  28

/* SYSTEM_SPI3_DMA_RST : R/W; bitpos: [27]; default: 0;
 * Set this bit to reset SPI3 DMA.
 */

#define SYSTEM_SPI3_DMA_RST    (BIT(27))
#define SYSTEM_SPI3_DMA_RST_M  (SYSTEM_SPI3_DMA_RST_V << SYSTEM_SPI3_DMA_RST_S)
#define SYSTEM_SPI3_DMA_RST_V  0x00000001
#define SYSTEM_SPI3_DMA_RST_S  27

/* SYSTEM_PWM3_RST : R/W; bitpos: [26]; default: 0;
 * Set this bit to reset PWM3.
 */

#define SYSTEM_PWM3_RST    (BIT(26))
#define SYSTEM_PWM3_RST_M  (SYSTEM_PWM3_RST_V << SYSTEM_PWM3_RST_S)
#define SYSTEM_PWM3_RST_V  0x00000001
#define SYSTEM_PWM3_RST_S  26

/* SYSTEM_PWM2_RST : R/W; bitpos: [25]; default: 0;
 * Set this bit to reset PWM2.
 */

#define SYSTEM_PWM2_RST    (BIT(25))
#define SYSTEM_PWM2_RST_M  (SYSTEM_PWM2_RST_V << SYSTEM_PWM2_RST_S)
#define SYSTEM_PWM2_RST_V  0x00000001
#define SYSTEM_PWM2_RST_S  25

/* SYSTEM_UART_MEM_RST : R/W; bitpos: [24]; default: 0;
 * Set this bit to reset UART memory.
 */

#define SYSTEM_UART_MEM_RST    (BIT(24))
#define SYSTEM_UART_MEM_RST_M  (SYSTEM_UART_MEM_RST_V << SYSTEM_UART_MEM_RST_S)
#define SYSTEM_UART_MEM_RST_V  0x00000001
#define SYSTEM_UART_MEM_RST_S  24

/* SYSTEM_USB_RST : R/W; bitpos: [23]; default: 0;
 * Set this bit to reset USB.
 */

#define SYSTEM_USB_RST    (BIT(23))
#define SYSTEM_USB_RST_M  (SYSTEM_USB_RST_V << SYSTEM_USB_RST_S)
#define SYSTEM_USB_RST_V  0x00000001
#define SYSTEM_USB_RST_S  23

/* SYSTEM_SPI2_DMA_RST : R/W; bitpos: [22]; default: 0;
 * Set this bit to reset SPI2 DMA.
 */

#define SYSTEM_SPI2_DMA_RST    (BIT(22))
#define SYSTEM_SPI2_DMA_RST_M  (SYSTEM_SPI2_DMA_RST_V << SYSTEM_SPI2_DMA_RST_S)
#define SYSTEM_SPI2_DMA_RST_V  0x00000001
#define SYSTEM_SPI2_DMA_RST_S  22

/* SYSTEM_I2S1_RST : R/W; bitpos: [21]; default: 0;
 * Set this bit to reset I2S1.
 */

#define SYSTEM_I2S1_RST    (BIT(21))
#define SYSTEM_I2S1_RST_M  (SYSTEM_I2S1_RST_V << SYSTEM_I2S1_RST_S)
#define SYSTEM_I2S1_RST_V  0x00000001
#define SYSTEM_I2S1_RST_S  21

/* SYSTEM_PWM1_RST : R/W; bitpos: [20]; default: 0;
 * Set this bit to reset PWM1.
 */

#define SYSTEM_PWM1_RST    (BIT(20))
#define SYSTEM_PWM1_RST_M  (SYSTEM_PWM1_RST_V << SYSTEM_PWM1_RST_S)
#define SYSTEM_PWM1_RST_V  0x00000001
#define SYSTEM_PWM1_RST_S  20

/* SYSTEM_CAN_RST : R/W; bitpos: [19]; default: 0;
 * Set this bit to reset CAN.
 */

#define SYSTEM_CAN_RST    (BIT(19))
#define SYSTEM_CAN_RST_M  (SYSTEM_CAN_RST_V << SYSTEM_CAN_RST_S)
#define SYSTEM_CAN_RST_V  0x00000001
#define SYSTEM_CAN_RST_S  19

/* SYSTEM_I2C_EXT1_RST : R/W; bitpos: [18]; default: 0;
 * Set this bit to reset I2C EXT1.
 */

#define SYSTEM_I2C_EXT1_RST    (BIT(18))
#define SYSTEM_I2C_EXT1_RST_M  (SYSTEM_I2C_EXT1_RST_V << SYSTEM_I2C_EXT1_RST_S)
#define SYSTEM_I2C_EXT1_RST_V  0x00000001
#define SYSTEM_I2C_EXT1_RST_S  18

/* SYSTEM_PWM0_RST : R/W; bitpos: [17]; default: 0;
 * Set this bit to reset PWM0.
 */

#define SYSTEM_PWM0_RST    (BIT(17))
#define SYSTEM_PWM0_RST_M  (SYSTEM_PWM0_RST_V << SYSTEM_PWM0_RST_S)
#define SYSTEM_PWM0_RST_V  0x00000001
#define SYSTEM_PWM0_RST_S  17

/* SYSTEM_SPI3_RST : R/W; bitpos: [16]; default: 0;
 * Set this bit to reset SPI3.
 */

#define SYSTEM_SPI3_RST    (BIT(16))
#define SYSTEM_SPI3_RST_M  (SYSTEM_SPI3_RST_V << SYSTEM_SPI3_RST_S)
#define SYSTEM_SPI3_RST_V  0x00000001
#define SYSTEM_SPI3_RST_S  16

/* SYSTEM_TIMERGROUP1_RST : R/W; bitpos: [15]; default: 0;
 * Set this bit to reset timer group1.
 */

#define SYSTEM_TIMERGROUP1_RST    (BIT(15))
#define SYSTEM_TIMERGROUP1_RST_M  (SYSTEM_TIMERGROUP1_RST_V << SYSTEM_TIMERGROUP1_RST_S)
#define SYSTEM_TIMERGROUP1_RST_V  0x00000001
#define SYSTEM_TIMERGROUP1_RST_S  15

/* SYSTEM_EFUSE_RST : R/W; bitpos: [14]; default: 0;
 * Set this bit to reset eFuse.
 */

#define SYSTEM_EFUSE_RST    (BIT(14))
#define SYSTEM_EFUSE_RST_M  (SYSTEM_EFUSE_RST_V << SYSTEM_EFUSE_RST_S)
#define SYSTEM_EFUSE_RST_V  0x00000001
#define SYSTEM_EFUSE_RST_S  14

/* SYSTEM_TIMERGROUP_RST : R/W; bitpos: [13]; default: 0;
 * Set this bit to reset timer group0.
 */

#define SYSTEM_TIMERGROUP_RST    (BIT(13))
#define SYSTEM_TIMERGROUP_RST_M  (SYSTEM_TIMERGROUP_RST_V << SYSTEM_TIMERGROUP_RST_S)
#define SYSTEM_TIMERGROUP_RST_V  0x00000001
#define SYSTEM_TIMERGROUP_RST_S  13

/* SYSTEM_UHCI1_RST : R/W; bitpos: [12]; default: 0;
 * Set this bit to reset UHCI1.
 */

#define SYSTEM_UHCI1_RST    (BIT(12))
#define SYSTEM_UHCI1_RST_M  (SYSTEM_UHCI1_RST_V << SYSTEM_UHCI1_RST_S)
#define SYSTEM_UHCI1_RST_V  0x00000001
#define SYSTEM_UHCI1_RST_S  12

/* SYSTEM_LEDC_RST : R/W; bitpos: [11]; default: 0;
 * Set this bit to reset LED PWM.
 */

#define SYSTEM_LEDC_RST    (BIT(11))
#define SYSTEM_LEDC_RST_M  (SYSTEM_LEDC_RST_V << SYSTEM_LEDC_RST_S)
#define SYSTEM_LEDC_RST_V  0x00000001
#define SYSTEM_LEDC_RST_S  11

/* SYSTEM_PCNT_RST : R/W; bitpos: [10]; default: 0;
 * Set this bit to reset pulse count.
 */

#define SYSTEM_PCNT_RST    (BIT(10))
#define SYSTEM_PCNT_RST_M  (SYSTEM_PCNT_RST_V << SYSTEM_PCNT_RST_S)
#define SYSTEM_PCNT_RST_V  0x00000001
#define SYSTEM_PCNT_RST_S  10

