apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_system.h
/* SYSTEM_RMT_RST : R/W; bitpos: [9]; default: 0;
 * Set this bit to reset remote controller.
 */

#define SYSTEM_RMT_RST    (BIT(9))
#define SYSTEM_RMT_RST_M  (SYSTEM_RMT_RST_V << SYSTEM_RMT_RST_S)
#define SYSTEM_RMT_RST_V  0x00000001
#define SYSTEM_RMT_RST_S  9

/* SYSTEM_UHCI0_RST : R/W; bitpos: [8]; default: 0;
 * Set this bit to reset UHCI0.
 */

#define SYSTEM_UHCI0_RST    (BIT(8))
#define SYSTEM_UHCI0_RST_M  (SYSTEM_UHCI0_RST_V << SYSTEM_UHCI0_RST_S)
#define SYSTEM_UHCI0_RST_V  0x00000001
#define SYSTEM_UHCI0_RST_S  8

/* SYSTEM_I2C_EXT0_RST : R/W; bitpos: [7]; default: 0;
 * Set this bit to reset I2C EXT0.
 */

#define SYSTEM_I2C_EXT0_RST    (BIT(7))
#define SYSTEM_I2C_EXT0_RST_M  (SYSTEM_I2C_EXT0_RST_V << SYSTEM_I2C_EXT0_RST_S)
#define SYSTEM_I2C_EXT0_RST_V  0x00000001
#define SYSTEM_I2C_EXT0_RST_S  7

/* SYSTEM_SPI2_RST : R/W; bitpos: [6]; default: 0;
 * Set this bit to reset SPI2.
 */

#define SYSTEM_SPI2_RST    (BIT(6))
#define SYSTEM_SPI2_RST_M  (SYSTEM_SPI2_RST_V << SYSTEM_SPI2_RST_S)
#define SYSTEM_SPI2_RST_V  0x00000001
#define SYSTEM_SPI2_RST_S  6

/* SYSTEM_UART1_RST : R/W; bitpos: [5]; default: 0;
 * Set this bit to reset UART1.
 */

#define SYSTEM_UART1_RST    (BIT(5))
#define SYSTEM_UART1_RST_M  (SYSTEM_UART1_RST_V << SYSTEM_UART1_RST_S)
#define SYSTEM_UART1_RST_V  0x00000001
#define SYSTEM_UART1_RST_S  5

/* SYSTEM_I2S0_RST : R/W; bitpos: [4]; default: 0;
 * Set this bit to reset I2S0.
 */

#define SYSTEM_I2S0_RST    (BIT(4))
#define SYSTEM_I2S0_RST_M  (SYSTEM_I2S0_RST_V << SYSTEM_I2S0_RST_S)
#define SYSTEM_I2S0_RST_V  0x00000001
#define SYSTEM_I2S0_RST_S  4

/* SYSTEM_WDG_RST : R/W; bitpos: [3]; default: 0;
 * Set this bit to reset WDG.
 */

#define SYSTEM_WDG_RST    (BIT(3))
#define SYSTEM_WDG_RST_M  (SYSTEM_WDG_RST_V << SYSTEM_WDG_RST_S)
#define SYSTEM_WDG_RST_V  0x00000001
#define SYSTEM_WDG_RST_S  3

/* SYSTEM_UART_RST : R/W; bitpos: [2]; default: 0;
 * Set this bit to reset UART0.
 */

#define SYSTEM_UART_RST    (BIT(2))
#define SYSTEM_UART_RST_M  (SYSTEM_UART_RST_V << SYSTEM_UART_RST_S)
#define SYSTEM_UART_RST_V  0x00000001
#define SYSTEM_UART_RST_S  2

/* SYSTEM_SPI01_RST : R/W; bitpos: [1]; default: 0;
 * Set this bit to reset SPI0 and SPI1.
 */

#define SYSTEM_SPI01_RST    (BIT(1))
#define SYSTEM_SPI01_RST_M  (SYSTEM_SPI01_RST_V << SYSTEM_SPI01_RST_S)
#define SYSTEM_SPI01_RST_V  0x00000001
#define SYSTEM_SPI01_RST_S  1

/* SYSTEM_TIMERS_RST : R/W; bitpos: [0]; default: 0;
 * Set this bit to reset timers.
 */

#define SYSTEM_TIMERS_RST    (BIT(0))
#define SYSTEM_TIMERS_RST_M  (SYSTEM_TIMERS_RST_V << SYSTEM_TIMERS_RST_S)
#define SYSTEM_TIMERS_RST_V  0x00000001
#define SYSTEM_TIMERS_RST_S  0

/* SYSTEM_PERIP_RST_EN1_REG register
 * System peripheral (hardware accelerators) reset register 1
 */

#define SYSTEM_PERIP_RST_EN1_REG (DR_REG_SYSTEM_BASE + 0x4c)

/* SYSTEM_CRYPTO_DMA_RST : R/W; bitpos: [6]; default: 1;
 * Set this bit to reset cryptography DMA.
 */

#define SYSTEM_CRYPTO_DMA_RST    (BIT(6))
#define SYSTEM_CRYPTO_DMA_RST_M  (SYSTEM_CRYPTO_DMA_RST_V << SYSTEM_CRYPTO_DMA_RST_S)
#define SYSTEM_CRYPTO_DMA_RST_V  0x00000001
#define SYSTEM_CRYPTO_DMA_RST_S  6

/* SYSTEM_CRYPTO_HMAC_RST : R/W; bitpos: [5]; default: 1;
 * Set this bit to reset cryptography HMAC.
 */

#define SYSTEM_CRYPTO_HMAC_RST    (BIT(5))
#define SYSTEM_CRYPTO_HMAC_RST_M  (SYSTEM_CRYPTO_HMAC_RST_V << SYSTEM_CRYPTO_HMAC_RST_S)
#define SYSTEM_CRYPTO_HMAC_RST_V  0x00000001
#define SYSTEM_CRYPTO_HMAC_RST_S  5

/* SYSTEM_CRYPTO_DS_RST : R/W; bitpos: [4]; default: 1;
 * Set this bit to reset cryptography digital signature.
 */

#define SYSTEM_CRYPTO_DS_RST    (BIT(4))
#define SYSTEM_CRYPTO_DS_RST_M  (SYSTEM_CRYPTO_DS_RST_V << SYSTEM_CRYPTO_DS_RST_S)
#define SYSTEM_CRYPTO_DS_RST_V  0x00000001
#define SYSTEM_CRYPTO_DS_RST_S  4

/* SYSTEM_CRYPTO_RSA_RST : R/W; bitpos: [3]; default: 1;
 * Set this bit to reset cryptography RSA.
 */

#define SYSTEM_CRYPTO_RSA_RST    (BIT(3))
#define SYSTEM_CRYPTO_RSA_RST_M  (SYSTEM_CRYPTO_RSA_RST_V << SYSTEM_CRYPTO_RSA_RST_S)
#define SYSTEM_CRYPTO_RSA_RST_V  0x00000001
#define SYSTEM_CRYPTO_RSA_RST_S  3

/* SYSTEM_CRYPTO_SHA_RST : R/W; bitpos: [2]; default: 1;
 * Set this bit to reset cryptography SHA.
 */

#define SYSTEM_CRYPTO_SHA_RST    (BIT(2))
#define SYSTEM_CRYPTO_SHA_RST_M  (SYSTEM_CRYPTO_SHA_RST_V << SYSTEM_CRYPTO_SHA_RST_S)
#define SYSTEM_CRYPTO_SHA_RST_V  0x00000001
#define SYSTEM_CRYPTO_SHA_RST_S  2

/* SYSTEM_CRYPTO_AES_RST : R/W; bitpos: [1]; default: 1;
 * Set this bit to reset cryptography AES.
 */

#define SYSTEM_CRYPTO_AES_RST    (BIT(1))
#define SYSTEM_CRYPTO_AES_RST_M  (SYSTEM_CRYPTO_AES_RST_V << SYSTEM_CRYPTO_AES_RST_S)
#define SYSTEM_CRYPTO_AES_RST_V  0x00000001
#define SYSTEM_CRYPTO_AES_RST_S  1

/* SYSTEM_LPCK_DIV_INT_REG register
 * Low power clock divider integer register
 */

#define SYSTEM_LPCK_DIV_INT_REG (DR_REG_SYSTEM_BASE + 0x50)

/* SYSTEM_LPCK_DIV_NUM : R/W; bitpos: [11:0]; default: 255;
 * This field is used to set the integer number of the divider value.
 */

#define SYSTEM_LPCK_DIV_NUM    0x00000fff
#define SYSTEM_LPCK_DIV_NUM_M  (SYSTEM_LPCK_DIV_NUM_V << SYSTEM_LPCK_DIV_NUM_S)
#define SYSTEM_LPCK_DIV_NUM_V  0x00000fff
#define SYSTEM_LPCK_DIV_NUM_S  0

/* SYSTEM_BT_LPCK_DIV_FRAC_REG register
 * Divider fraction configuration register for low-power clock
 */

#define SYSTEM_BT_LPCK_DIV_FRAC_REG (DR_REG_SYSTEM_BASE + 0x54)

/* SYSTEM_LPCLK_RTC_EN : R/W; bitpos: [28]; default: 0;
 * Set this bit to enable the RTC low power clock.
 */

#define SYSTEM_LPCLK_RTC_EN    (BIT(28))
#define SYSTEM_LPCLK_RTC_EN_M  (SYSTEM_LPCLK_RTC_EN_V << SYSTEM_LPCLK_RTC_EN_S)
#define SYSTEM_LPCLK_RTC_EN_V  0x00000001
#define SYSTEM_LPCLK_RTC_EN_S  28

/* SYSTEM_LPCLK_SEL_XTAL32K : R/W; bitpos: [27]; default: 0;
 * Set this bit to select xtal32k clock as the low power clock.
 */

#define SYSTEM_LPCLK_SEL_XTAL32K    (BIT(27))
#define SYSTEM_LPCLK_SEL_XTAL32K_M  (SYSTEM_LPCLK_SEL_XTAL32K_V << SYSTEM_LPCLK_SEL_XTAL32K_S)
#define SYSTEM_LPCLK_SEL_XTAL32K_V  0x00000001
#define SYSTEM_LPCLK_SEL_XTAL32K_S  27

/* SYSTEM_LPCLK_SEL_XTAL : R/W; bitpos: [26]; default: 0;
 * Set this bit to select xtal clock as the low power clock.
 */

#define SYSTEM_LPCLK_SEL_XTAL    (BIT(26))
#define SYSTEM_LPCLK_SEL_XTAL_M  (SYSTEM_LPCLK_SEL_XTAL_V << SYSTEM_LPCLK_SEL_XTAL_S)
#define SYSTEM_LPCLK_SEL_XTAL_V  0x00000001
#define SYSTEM_LPCLK_SEL_XTAL_S  26

