apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_system.h
/* SYSTEM_LPCLK_SEL_8M : R/W; bitpos: [25]; default: 1;
 * Set this bit to select 8m clock as the low power clock.
 */

#define SYSTEM_LPCLK_SEL_8M    (BIT(25))
#define SYSTEM_LPCLK_SEL_8M_M  (SYSTEM_LPCLK_SEL_8M_V << SYSTEM_LPCLK_SEL_8M_S)
#define SYSTEM_LPCLK_SEL_8M_V  0x00000001
#define SYSTEM_LPCLK_SEL_8M_S  25

/* SYSTEM_LPCLK_SEL_RTC_SLOW : R/W; bitpos: [24]; default: 0;
 * Set this bit to select RTC slow clock as the low power clock.
 */

#define SYSTEM_LPCLK_SEL_RTC_SLOW    (BIT(24))
#define SYSTEM_LPCLK_SEL_RTC_SLOW_M  (SYSTEM_LPCLK_SEL_RTC_SLOW_V << SYSTEM_LPCLK_SEL_RTC_SLOW_S)
#define SYSTEM_LPCLK_SEL_RTC_SLOW_V  0x00000001
#define SYSTEM_LPCLK_SEL_RTC_SLOW_S  24

/* SYSTEM_BT_LPCK_DIV_A : R/W ;bitpos:[23:12] ;default: 1 */

#define SYSTEM_BT_LPCK_DIV_A  0x00000FFF
#define SYSTEM_BT_LPCK_DIV_A_M  ((SYSTEM_BT_LPCK_DIV_A_V)<<(SYSTEM_BT_LPCK_DIV_A_S))
#define SYSTEM_BT_LPCK_DIV_A_V  0xFFF
#define SYSTEM_BT_LPCK_DIV_A_S  12

/* SYSTEM_BT_LPCK_DIV_B : R/W ;bitpos:[11:0] ;default: 1 */

#define SYSTEM_BT_LPCK_DIV_B  0x00000FFF
#define SYSTEM_BT_LPCK_DIV_B_M  ((SYSTEM_BT_LPCK_DIV_B_V)<<(SYSTEM_BT_LPCK_DIV_B_S))
#define SYSTEM_BT_LPCK_DIV_B_V  0xFFF
#define SYSTEM_BT_LPCK_DIV_B_S  0

/* SYSTEM_CPU_INTR_FROM_CPU_0_REG register
 * CPU interrupt controlling register 0
 */

#define SYSTEM_CPU_INTR_FROM_CPU_0_REG (DR_REG_SYSTEM_BASE + 0x58)

/* SYSTEM_CPU_INTR_FROM_CPU_0 : R/W; bitpos: [0]; default: 0;
 * Set this bit to generate CPU interrupt 0. This bit needs to be reset by
 * software in the ISR process.
 */

#define SYSTEM_CPU_INTR_FROM_CPU_0    (BIT(0))
#define SYSTEM_CPU_INTR_FROM_CPU_0_M  (SYSTEM_CPU_INTR_FROM_CPU_0_V << SYSTEM_CPU_INTR_FROM_CPU_0_S)
#define SYSTEM_CPU_INTR_FROM_CPU_0_V  0x00000001
#define SYSTEM_CPU_INTR_FROM_CPU_0_S  0

/* SYSTEM_CPU_INTR_FROM_CPU_1_REG register
 * CPU interrupt controlling register 1
 */

#define SYSTEM_CPU_INTR_FROM_CPU_1_REG (DR_REG_SYSTEM_BASE + 0x5c)

/* SYSTEM_CPU_INTR_FROM_CPU_1 : R/W; bitpos: [0]; default: 0;
 * Set this bit to generate CPU interrupt 1. This bit needs to be reset by
 * software in the ISR process.
 */

#define SYSTEM_CPU_INTR_FROM_CPU_1    (BIT(0))
#define SYSTEM_CPU_INTR_FROM_CPU_1_M  (SYSTEM_CPU_INTR_FROM_CPU_1_V << SYSTEM_CPU_INTR_FROM_CPU_1_S)
#define SYSTEM_CPU_INTR_FROM_CPU_1_V  0x00000001
#define SYSTEM_CPU_INTR_FROM_CPU_1_S  0

/* SYSTEM_CPU_INTR_FROM_CPU_2_REG register
 * CPU interrupt controlling register 2
 */

#define SYSTEM_CPU_INTR_FROM_CPU_2_REG (DR_REG_SYSTEM_BASE + 0x60)

/* SYSTEM_CPU_INTR_FROM_CPU_2 : R/W; bitpos: [0]; default: 0;
 * Set this bit to generate CPU interrupt 2. This bit needs to be reset by
 * software in the ISR process.
 */

#define SYSTEM_CPU_INTR_FROM_CPU_2    (BIT(0))
#define SYSTEM_CPU_INTR_FROM_CPU_2_M  (SYSTEM_CPU_INTR_FROM_CPU_2_V << SYSTEM_CPU_INTR_FROM_CPU_2_S)
#define SYSTEM_CPU_INTR_FROM_CPU_2_V  0x00000001
#define SYSTEM_CPU_INTR_FROM_CPU_2_S  0

/* SYSTEM_CPU_INTR_FROM_CPU_3_REG register
 * CPU interrupt controlling register 3
 */

#define SYSTEM_CPU_INTR_FROM_CPU_3_REG (DR_REG_SYSTEM_BASE + 0x64)

/* SYSTEM_CPU_INTR_FROM_CPU_3 : R/W; bitpos: [0]; default: 0;
 * Set this bit to generate CPU interrupt 3. This bit needs to be reset by
 * software in the ISR process.
 */

#define SYSTEM_CPU_INTR_FROM_CPU_3    (BIT(0))
#define SYSTEM_CPU_INTR_FROM_CPU_3_M  (SYSTEM_CPU_INTR_FROM_CPU_3_V << SYSTEM_CPU_INTR_FROM_CPU_3_S)
#define SYSTEM_CPU_INTR_FROM_CPU_3_V  0x00000001
#define SYSTEM_CPU_INTR_FROM_CPU_3_S  0

/* SYSTEM_RSA_PD_CTRL_REG register
 * RSA memory remapping register
 */

#define SYSTEM_RSA_PD_CTRL_REG (DR_REG_SYSTEM_BASE + 0x68)

/* SYSTEM_RSA_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 * Set this bit to force power down RSA memory. This bit has the highest
 * priority.
 */

#define SYSTEM_RSA_MEM_FORCE_PD    (BIT(2))
#define SYSTEM_RSA_MEM_FORCE_PD_M  (SYSTEM_RSA_MEM_FORCE_PD_V << SYSTEM_RSA_MEM_FORCE_PD_S)
#define SYSTEM_RSA_MEM_FORCE_PD_V  0x00000001
#define SYSTEM_RSA_MEM_FORCE_PD_S  2

/* SYSTEM_RSA_MEM_FORCE_PU : R/W; bitpos: [1]; default: 0;
 * Set this bit to force power up RSA memory. This bit has the second
 * highest priority.
 */

#define SYSTEM_RSA_MEM_FORCE_PU    (BIT(1))
#define SYSTEM_RSA_MEM_FORCE_PU_M  (SYSTEM_RSA_MEM_FORCE_PU_V << SYSTEM_RSA_MEM_FORCE_PU_S)
#define SYSTEM_RSA_MEM_FORCE_PU_V  0x00000001
#define SYSTEM_RSA_MEM_FORCE_PU_S  1

/* SYSTEM_RSA_MEM_PD : R/W; bitpos: [0]; default: 1;
 * Set this bit to power down RSA memory. This bit has the lowest priority.
 * When Digital Signature occupies the RSA, this bit is invalid.
 */

#define SYSTEM_RSA_MEM_PD    (BIT(0))
#define SYSTEM_RSA_MEM_PD_M  (SYSTEM_RSA_MEM_PD_V << SYSTEM_RSA_MEM_PD_S)
#define SYSTEM_RSA_MEM_PD_V  0x00000001
#define SYSTEM_RSA_MEM_PD_S  0
#define SYSTEM_RSA_PD SYSTEM_RSA_MEM_PD

/* SYSTEM_BUSTOEXTMEM_ENA_REG register
 * EDMA enable register
 */

#define SYSTEM_BUSTOEXTMEM_ENA_REG (DR_REG_SYSTEM_BASE + 0x6c)

/* SYSTEM_BUSTOEXTMEM_ENA : R/W; bitpos: [0]; default: 1;
 * Set this bit to enable bus to EDMA.
 */

#define SYSTEM_BUSTOEXTMEM_ENA    (BIT(0))
#define SYSTEM_BUSTOEXTMEM_ENA_M  (SYSTEM_BUSTOEXTMEM_ENA_V << SYSTEM_BUSTOEXTMEM_ENA_S)
#define SYSTEM_BUSTOEXTMEM_ENA_V  0x00000001
#define SYSTEM_BUSTOEXTMEM_ENA_S  0

/* SYSTEM_CACHE_CONTROL_REG register
 * Cache control register
 */

#define SYSTEM_CACHE_CONTROL_REG (DR_REG_SYSTEM_BASE + 0x70)

/* SYSTEM_PRO_CACHE_RESET : R/W; bitpos: [2]; default: 0;
 * Set this bit to reset cache.
 */

#define SYSTEM_PRO_CACHE_RESET    (BIT(2))
#define SYSTEM_PRO_CACHE_RESET_M  (SYSTEM_PRO_CACHE_RESET_V << SYSTEM_PRO_CACHE_RESET_S)
#define SYSTEM_PRO_CACHE_RESET_V  0x00000001
#define SYSTEM_PRO_CACHE_RESET_S  2

/* SYSTEM_PRO_DCACHE_CLK_ON : R/W; bitpos: [1]; default: 1;
 * Set this bit to enable clock of d-cache.
 */

#define SYSTEM_PRO_DCACHE_CLK_ON    (BIT(1))
#define SYSTEM_PRO_DCACHE_CLK_ON_M  (SYSTEM_PRO_DCACHE_CLK_ON_V << SYSTEM_PRO_DCACHE_CLK_ON_S)
#define SYSTEM_PRO_DCACHE_CLK_ON_V  0x00000001
#define SYSTEM_PRO_DCACHE_CLK_ON_S  1

/* SYSTEM_PRO_ICACHE_CLK_ON : R/W; bitpos: [0]; default: 1;
 * Set this bit to enable clock of i-cache.
 */

#define SYSTEM_PRO_ICACHE_CLK_ON    (BIT(0))
#define SYSTEM_PRO_ICACHE_CLK_ON_M  (SYSTEM_PRO_ICACHE_CLK_ON_V << SYSTEM_PRO_ICACHE_CLK_ON_S)
#define SYSTEM_PRO_ICACHE_CLK_ON_V  0x00000001
#define SYSTEM_PRO_ICACHE_CLK_ON_S  0

/* SYSTEM_EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROL_REG register
 * External memory encrypt and decrypt controlling register
 */

#define SYSTEM_EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROL_REG (DR_REG_SYSTEM_BASE + 0x74)

/* SYSTEM_ENABLE_DOWNLOAD_MANUAL_ENCRYPT : R/W; bitpos: [3]; default: 0;
 * Set this bit to enable Manual Encryption under Download Boot mode.
 */

#define SYSTEM_ENABLE_DOWNLOAD_MANUAL_ENCRYPT    (BIT(3))
#define SYSTEM_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_M  (SYSTEM_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_V << SYSTEM_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_S)
#define SYSTEM_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_V  0x00000001
#define SYSTEM_ENABLE_DOWNLOAD_MANUAL_ENCRYPT_S  3

/* SYSTEM_ENABLE_DOWNLOAD_G0CB_DECRYPT : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable Auto Decryption under Download Boot mode.
 */

#define SYSTEM_ENABLE_DOWNLOAD_G0CB_DECRYPT    (BIT(2))
#define SYSTEM_ENABLE_DOWNLOAD_G0CB_DECRYPT_M  (SYSTEM_ENABLE_DOWNLOAD_G0CB_DECRYPT_V << SYSTEM_ENABLE_DOWNLOAD_G0CB_DECRYPT_S)
#define SYSTEM_ENABLE_DOWNLOAD_G0CB_DECRYPT_V  0x00000001
#define SYSTEM_ENABLE_DOWNLOAD_G0CB_DECRYPT_S  2

/* SYSTEM_ENABLE_DOWNLOAD_DB_ENCRYPT : R/W; bitpos: [1]; default: 0;
 * Set this bit to enable Auto Encryption under Download Boot mode.
 */

