apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_system.h
#define SYSTEM_ENABLE_DOWNLOAD_DB_ENCRYPT    (BIT(1))
#define SYSTEM_ENABLE_DOWNLOAD_DB_ENCRYPT_M  (SYSTEM_ENABLE_DOWNLOAD_DB_ENCRYPT_V << SYSTEM_ENABLE_DOWNLOAD_DB_ENCRYPT_S)
#define SYSTEM_ENABLE_DOWNLOAD_DB_ENCRYPT_V  0x00000001
#define SYSTEM_ENABLE_DOWNLOAD_DB_ENCRYPT_S  1

/* SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT : R/W; bitpos: [0]; default: 0;
 * Set this bit to enable Manual Encryption under SPI Boot mode.
 */

#define SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT    (BIT(0))
#define SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT_M  (SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT_V << SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT_S)
#define SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT_V  0x00000001
#define SYSTEM_ENABLE_SPI_MANUAL_ENCRYPT_S  0

/* SYSTEM_RTC_FASTMEM_CONFIG_REG register
 * RTC fast memory configuration register
 */

#define SYSTEM_RTC_FASTMEM_CONFIG_REG (DR_REG_SYSTEM_BASE + 0x78)

/* SYSTEM_RTC_MEM_CRC_FINISH : RO; bitpos: [31]; default: 0;
 * This bit stores the status of RTC memory CRC. High level means finished
 * while low level means not finished.
 */

#define SYSTEM_RTC_MEM_CRC_FINISH    (BIT(31))
#define SYSTEM_RTC_MEM_CRC_FINISH_M  (SYSTEM_RTC_MEM_CRC_FINISH_V << SYSTEM_RTC_MEM_CRC_FINISH_S)
#define SYSTEM_RTC_MEM_CRC_FINISH_V  0x00000001
#define SYSTEM_RTC_MEM_CRC_FINISH_S  31

/* SYSTEM_RTC_MEM_CRC_LEN : R/W; bitpos: [30:20]; default: 2047;
 * This field is used to set length of RTC memory for CRC based on start
 * address.
 */

#define SYSTEM_RTC_MEM_CRC_LEN    0x000007ff
#define SYSTEM_RTC_MEM_CRC_LEN_M  (SYSTEM_RTC_MEM_CRC_LEN_V << SYSTEM_RTC_MEM_CRC_LEN_S)
#define SYSTEM_RTC_MEM_CRC_LEN_V  0x000007ff
#define SYSTEM_RTC_MEM_CRC_LEN_S  20

/* SYSTEM_RTC_MEM_CRC_ADDR : R/W; bitpos: [19:9]; default: 0;
 * This field is used to set address of RTC memory for CRC.
 */

#define SYSTEM_RTC_MEM_CRC_ADDR    0x000007ff
#define SYSTEM_RTC_MEM_CRC_ADDR_M  (SYSTEM_RTC_MEM_CRC_ADDR_V << SYSTEM_RTC_MEM_CRC_ADDR_S)
#define SYSTEM_RTC_MEM_CRC_ADDR_V  0x000007ff
#define SYSTEM_RTC_MEM_CRC_ADDR_S  9

/* SYSTEM_RTC_MEM_CRC_START : R/W; bitpos: [8]; default: 0;
 * Set this bit to start the CRC of RTC memory.
 */

#define SYSTEM_RTC_MEM_CRC_START    (BIT(8))
#define SYSTEM_RTC_MEM_CRC_START_M  (SYSTEM_RTC_MEM_CRC_START_V << SYSTEM_RTC_MEM_CRC_START_S)
#define SYSTEM_RTC_MEM_CRC_START_V  0x00000001
#define SYSTEM_RTC_MEM_CRC_START_S  8

/* SYSTEM_RTC_FASTMEM_CRC_REG register
 * RTC fast memory CRC controlling register
 */

#define SYSTEM_RTC_FASTMEM_CRC_REG (DR_REG_SYSTEM_BASE + 0x7c)

/* SYSTEM_RTC_MEM_CRC_RES : RO; bitpos: [31:0]; default: 0;
 * This field stores the CRC result of RTC memory.
 */

#define SYSTEM_RTC_MEM_CRC_RES    0xffffffff
#define SYSTEM_RTC_MEM_CRC_RES_M  (SYSTEM_RTC_MEM_CRC_RES_V << SYSTEM_RTC_MEM_CRC_RES_S)
#define SYSTEM_RTC_MEM_CRC_RES_V  0xffffffff
#define SYSTEM_RTC_MEM_CRC_RES_S  0

/* SYSTEM_Redundant_ECO_Ctrl_REG register
 * Redundant ECO control register
 */

#define SYSTEM_REDUNDANT_ECO_CTRL_REG (DR_REG_SYSTEM_BASE + 0x80)

/* SYSTEM_REDUNDANT_ECO_RESULT : RO; bitpos: [1]; default: 0;
 * The redundant ECO result bit to avoid optimization in circuits.
 */

#define SYSTEM_REDUNDANT_ECO_RESULT    (BIT(1))
#define SYSTEM_REDUNDANT_ECO_RESULT_M  (SYSTEM_REDUNDANT_ECO_RESULT_V << SYSTEM_REDUNDANT_ECO_RESULT_S)
#define SYSTEM_REDUNDANT_ECO_RESULT_V  0x00000001
#define SYSTEM_REDUNDANT_ECO_RESULT_S  1

/* SYSTEM_REDUNDANT_ECO_DRIVE : R/W; bitpos: [0]; default: 0;
 * The redundant ECO drive bit to avoid optimization in circuits.
 */

#define SYSTEM_REDUNDANT_ECO_DRIVE    (BIT(0))
#define SYSTEM_REDUNDANT_ECO_DRIVE_M  (SYSTEM_REDUNDANT_ECO_DRIVE_V << SYSTEM_REDUNDANT_ECO_DRIVE_S)
#define SYSTEM_REDUNDANT_ECO_DRIVE_V  0x00000001
#define SYSTEM_REDUNDANT_ECO_DRIVE_S  0

/* SYSTEM_CLOCK_GATE_REG register
 * Clock gate control register
 */

#define SYSTEM_CLOCK_GATE_REG (DR_REG_SYSTEM_BASE + 0x84)

/* SYSTEM_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set this bit to enable clock of this module.
 */

#define SYSTEM_CLK_EN    (BIT(0))
#define SYSTEM_CLK_EN_M  (SYSTEM_CLK_EN_V << SYSTEM_CLK_EN_S)
#define SYSTEM_CLK_EN_V  0x00000001
#define SYSTEM_CLK_EN_S  0

/* SYSTEM_SRAM_CTRL_2_REG register
 * System SRAM configuration register 2
 */

#define SYSTEM_SRAM_CTRL_2_REG (DR_REG_SYSTEM_BASE + 0x88)

/* SYSTEM_SRAM_FORCE_PU : R/W; bitpos: [21:0]; default: 4194303;
 * This field is used to power up internal SRAM.
 */

#define SYSTEM_SRAM_FORCE_PU    0x003fffff
#define SYSTEM_SRAM_FORCE_PU_M  (SYSTEM_SRAM_FORCE_PU_V << SYSTEM_SRAM_FORCE_PU_S)
#define SYSTEM_SRAM_FORCE_PU_V  0x003fffff
#define SYSTEM_SRAM_FORCE_PU_S  0

/* SYSTEM_SYSCLK_CONF_REG register
 * SoC clock configuration register
 */

#define SYSTEM_SYSCLK_CONF_REG (DR_REG_SYSTEM_BASE + 0x8c)

/* SYSTEM_CLK_DIV_EN : RO; bitpos: [19]; default: 0;
 * Not used, extends from ESP32.
 */

#define SYSTEM_CLK_DIV_EN    (BIT(19))
#define SYSTEM_CLK_DIV_EN_M  (SYSTEM_CLK_DIV_EN_V << SYSTEM_CLK_DIV_EN_S)
#define SYSTEM_CLK_DIV_EN_V  0x00000001
#define SYSTEM_CLK_DIV_EN_S  19

/* SYSTEM_CLK_XTAL_FREQ : RO; bitpos: [18:12]; default: 0;
 * This field is used to read XTAL frequency in MHz.
 */

#define SYSTEM_CLK_XTAL_FREQ    0x0000007f
#define SYSTEM_CLK_XTAL_FREQ_M  (SYSTEM_CLK_XTAL_FREQ_V << SYSTEM_CLK_XTAL_FREQ_S)
#define SYSTEM_CLK_XTAL_FREQ_V  0x0000007f
#define SYSTEM_CLK_XTAL_FREQ_S  12

/* SYSTEM_SOC_CLK_SEL : R/W; bitpos: [11:10]; default: 0;
 * This field is used to select SOC clock.
 */

#define SYSTEM_SOC_CLK_SEL    0x00000003
#define SYSTEM_SOC_CLK_SEL_M  (SYSTEM_SOC_CLK_SEL_V << SYSTEM_SOC_CLK_SEL_S)
#define SYSTEM_SOC_CLK_SEL_V  0x00000003
#define SYSTEM_SOC_CLK_SEL_S  10

/* SYSTEM_PRE_DIV_CNT : R/W; bitpos: [9:0]; default: 1;
 * This field is used to set the count of prescaler of XTAL\_CLK.
 */

#define SYSTEM_PRE_DIV_CNT    0x000003ff
#define SYSTEM_PRE_DIV_CNT_M  (SYSTEM_PRE_DIV_CNT_V << SYSTEM_PRE_DIV_CNT_S)
#define SYSTEM_PRE_DIV_CNT_V  0x000003ff
#define SYSTEM_PRE_DIV_CNT_S  0

/* SYSTEM_DATE_REG register
 * Version control register
 */

#define SYSTEM_DATE_REG (DR_REG_SYSTEM_BASE + 0xffc)

/* SYSTEM_DATE : R/W; bitpos: [27:0]; default: 26247200;
 * Version control register.
 */

#define SYSTEM_DATE    0x0fffffff
#define SYSTEM_DATE_M  (SYSTEM_DATE_V << SYSTEM_DATE_S)
#define SYSTEM_DATE_V  0x0fffffff
#define SYSTEM_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_SYSTEM_H */
